/* 题目信息
运用矩阵可计算斐波拉契数列，使用 $C$ 语言或者 $C++$ 编写计算矩阵幂的算法，
常用数据结构的常用操作可直接使用，但需要说明。实现算法的执行过程
*/



/* -----------------------------以下为作答部分---------------------------------- */

#include <stdio.h>

#define MAX_LEN 100


// 使用 二维数组 存储计算斐波那契数列的矩阵
void CalculateFibonacciMatrixPower(int (*matrx)[2]) {
    
}



/* 
    算法实现如上，其中：
    
    时间复杂度为 O()	------
    
    空间复杂度为 O()	------
    
    算法思想
	
	测试数据

 */


/* -----------------------------作答部分结束---------------------------------- */


// 测试主函数 此处不出现在真实考场答案中

int main() {

}
